{
    "basics": {
      "name": "Martin Ponce",
      "label": "Graduate Software Developer",
      "picture": "",
      "email": "martin.ponce@outlook.com",
      "phone": "+61 416 357 709",
      "website": "http://resume.martinponce.com.au",
      "summary": "",
      "location": {
        "address": "U2 / 93 Scarborough Beach Rd",
        "postalCode": "6016",
        "city": "MT HAWTHORN",
        "countryCode": "AU",
        "region": "WA"
      },
      "profiles": [{
        "network": "Github",
        "username": "martymcflywa",
        "url": "https://github.com/martymcflywa"
      },
      {
        "network": "Linkedin",
        "username": "Martin Ponce",
        "url": "https://www.linkedin.com/in/martin-ponce-0b350871/"
      }]
    },
    "work": [
    {
      "company": "Cash Converters, Perth, WA",
      "position": "Graduate Software Developer",
      "website": "http://cashconverters.com.au",
      "startDate": "2017-08-07",
      "endDate": "2017-02-09",
      "summary": "I was employed at Cash Converters under a 6 month contract and was involved in two projects, Business Intelligence and Single Customer View, developing in .NET Core and C#. This opportunity has exposed me to the CQRS pattern, event sourcing as well and has furthered my experience in continuous integration/delivery.",
      "highlights": [
        "I was responsible for developing a 'Loan Book' event source read model for the Executive Dashboard, providing a view of outstanding loan balances, broken down and filterable by product, date, working closely with stakeholders from Personal Finance to understand and implement business rules around the calculation of the balance.",
        "I was involved in making improvements to the existing CI/CD pipeline in AppVeyor and Octopus Deploy, speeding up test times by avoiding redundant rebuilds. I was also responsible for improving deployment resiliency by ensuring that all dependencies are packed into the release package, avoiding the need for access to nuget.org for applications deployed on-premise.",
        "I spent time on the Single Customer View project, with a goal to unify a customer that may exist as multiple instances of a customer within many business systems, as a single entity, to improve segmentation and targeted marketing, as well as a source for customer self service.",
        "My responsibility in Single Customer View was to develop extractor services for multiple customer stores, which cleansed the data, checked the customer record's validity then persisted to a NoSQL store for a transformer service to consume and perform customer matching. Some customer stores were from traditional SQL databases, and others were an event source, accessed via a REST API.",
        "I assisted in developing an event source replicator, which replicated the personal finance event source into a flat file binary MessagePack format. The intention was to improve event source read model population, by substituting event source reads from a remote SQL server to flat files, stored locally to a read model service. I also developed packages for developers to read the event store in the MessagePack format, so that internal deveslopers can quickly integrate this feature into other services.",
        "Throughout my time at Cash Converters, I adhered to Agile and Scrum methodologies, attending daily standups and fortnightly sprint planning sessions."
      ]
    },
    {
        "company": "IBM, Perth, WA",
        "position": "Intern Software Developer",
        "website": "http://ibm.com.au",
        "startDate": "2016-01-18",
        "endDate": "2017-07-28",
        "summary": "Due to my HD grade average, I was invited to take part in ECU's Work Integrated Learning program, and applied for an internship at IBM. During my internship, I was heavily involved in the developent of a brand new commercial product and gained valuable experience working in a professional environment where my knowledge, technical and interpersonal skills were put to the test in a software development role.",
        "highlights": [
            "I developed proof of concept features for an existing product, z Operational Insights (zOI), which provided mainframe system insights based on user uploaded logs.",
            "I was involved in providing additional system analysis in a Java 8 based backend for the zOI product, serving insights via REST API endpoints to an Angular 1 based frontend.",
            "I was also involved in visualising data for zOI, presenting analytics graphically, using D3.js.",
            "The majority of my internship was spent on development of a greenfield project called Common Data Provider for z Systems (CDPz), which gathered log records from multiple sources in a z/OS system, processes the data then forwards them to multiple subscribers through a single interface.",
            "I was able to gain a deep understanding of the Java component of CDPz in a short period of time, and was asked to assist in the design of some data processing features.",
            "My expertise in the Java component was highly regarded, and as an intern, was invited to travel to the US to hand over the project to a different development team.",
            "I demonstrated my ability to be self sufficient, working remotely with the dev team in the US in a full time capacity."
        ]
    }],
    "education": [
    {
      "institution": "Edith Cowan University, Perth, WA",
      "area": "Computer Science, Major Software Engineer",
      "studyType": "Bachelor",
      "startDate": "2014-06-01",
      "endDate": "",
      "gpa": "83.23",
      "courses": [
        "CSG1132: Communicating in an IT Environment",
        "CSI1241: Systems Analysis",
        "CSP1150: Programming Principles",
        "ENS1161: Computer Fundamentals",
        "CSG1105: Applied Communications",
        "CSG1207: Systems and Database Design",
        "CSI1101: Computer Security",
        "CSP2348: Data Structures",
        "CSG1102: Operating Systems",
        "CSG2341: Intelligent Systems",
        "CSG2344: Project Methods and Professionalism",
        "CSI2441: Applications Development",
        "CSI3345: Work Integrated Learning (IBM Internship)"
      ]
    },
    {
        "institution": "KvB Institute of Technology, North Sydney, NSW",
        "area": "Graphic Design, Print and Digital Media",
        "studyType": "Diploma",
        "startDate": "2002-01-01",
        "endDate": "2003-12-30",
        "gpa": "76.46"
    }],
    "skills": [{
      "name": "Backend development",
      "level": "Intermediate",
      "keywords": [
        "Java",
        "C#, .NET Core, .NET MVC",
        "MS SQL/MySQL",
        "NoSQL/Azure table storage",
        "Azure blob storage",
        "Behavior/test driven development"
      ]
    },
    {
      "name": "CI/CD",
      "level": "Intermediate",
      "keywords": [
        "Gradle",
        "Azure",
        "AppVeyor",
        "TravisCI",
        "Octopus deploy",
        "Powershell CLI/scripting",
        "Linux CLI/bash scripting"
      ]
    },
    {
      "name": "Frontend development",
      "level": "Basic",
      "keywords": [
        "Javascript",
        "HTML",
        "PHP",
        "Angular",
        "D3.js"
      ]
    }],
    "interests": [{
      "name": "Basketball",
      "keywords": [
        "Weekly team competition"
      ]
    },
    {
      "name": "Electronic music production",
      "keywords": [
        "Ableton",
        "Serato"
      ]
    },
    {
      "name": "Gaming",
      "keywords": [
        "PC",
        "Console"
      ]
    }]
  }