{
  "basics": {
    "name": "Martin Ponce",
    "label": "Software Developer",
    "picture": "https://resume.martinponce.com.au/img/marty.png",
    "email": "martin.ponce@outlook.com",
    "phone": "+61 416 357 709",
    "website": "https://resume.martinponce.com.au",
    "summary": "I am a software developer with experience in delivering clean, testable and maintainable solutions and system improvements. With plenty of experience in establishing and maintaining continuous integration pipelines and delivery automation, I aspire to become a well rounded full stack developer. Outside of work, I enjoy spending time with my family, watching and playing basketball and writing electronic music whenever I have spare time.",
    "location": {
      "address": "U2 / 93 Scarborough Beach Rd",
      "postalCode": "6016",
      "city": "Mount Hawthorn",
      "countryCode": "AU",
      "region": "WA"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "martymcflywa",
        "url": "https://github.com/martymcflywa"
      },
      {
        "network": "LinkedIn",
        "username": "Martin Ponce",
        "url": "https://www.linkedin.com/in/martin-ponce-0b350871/"
      }
    ]
  },
  "work": [
    {
      "company": "Campfire Digital Technology",
      "position": "Senior Java Developer",
      "website": "https://campfire.com.au/",
      "startDate": "2021-05-17",
      "highlights": []
    },
    {
      "company": "21st Century Software, Perth",
      "position": "Software Engineer",
      "website": "https://www.21stcenturysoftware.com/",
      "startDate": "2020-11-02",
      "endDate": "2021-05-14",
      "highlights": [
        "Formalised Java component build processes by migrating projects from Ant to Maven, and automated the process using Jenkins on a zLinux build server.",
        "Implemented a 'Fractal Forecasting' algorithm, to provide insights for Mainframe resource consumption for future yearly events which may not occur on the same date.",
        "Implemented a 'Workload Simulator' forecasting algorithm, to provide insights for Mainframe resource consumption by modelling how a mainframe dispatches work to its processors, while applying increased growth of work and/or hypothetical hardware upgrades.",
        "Responsible for technical writing, by updating the manual to explain how to use the new features I implement in the product."
      ]
    },
    {
      "company": "Bankwest, Perth",
      "position": "Java Developer, Senior IT Specialist (from November 2019)",
      "website": "https://bankwest.com.au",
      "startDate": "2018-03-26",
      "endDate": "2020-10-30",
      "highlights": [
        "Received numerous awards and recognition for challenging the status quo of previous performance tests and taking ownership of the design and delivery of a more resilient, accurate, flexible, highly automated and easier to maintain framework solution in JMeter.",
        "Created interactive dashboards and data visualisation for performance test results using Elastic Search, Logstash and Kibana, paired with an automated pdf report generation and distribution tool written in Typescript and Nodejs.",
        "One of only a few team members cross skilled, capable and responsible for the maintenance and improvement of three different platforms.",
        "I have automated many tasks that my team mates and I perform, such as setting up our development environment, to managing CI pipelines, deploying builds and triggering test suites using Jenkins and TeamCity, increasing our speed to get code into production.",
        "Delivered features and bug fixes for an internal Java lending application hosted on JBoss EAP.",
        "Contributed to the migration of an internal lending application from Java 7 to OpenJDK 8 and JBoss EAP 5 to JBoss EAP 7.1, which not only involved code updates, but also infrastructure setup and configuration.",
        "Delivered features and bug fixes for a core banking REST API platform using metaprogramming techniques with xtend/xtext, deployed to a mainframe environment.",
        "Delivered features and bug fixes for a Spring based legal document distribution application."
      ]
    },
    {
      "company": "Cash Converters, Perth",
      "position": "Graduate Software Developer",
      "website": "https://cashconverters.com.au",
      "startDate": "2017-08-07",
      "endDate": "2018-02-09",
      "highlights": [
        "Responsible for the development of customer datalake import services which extracted, validated, cleansed and matched customer data from many Cash Converter systems and persisted the data to a cloud NoSQL store to facilitate consumer segmentation and improve marketing strategies.",
        "Developed an event source replication library which considerably improved read model population, consumed by business intelligence reports, by utilizing flat file binary formats, cached on high speed NVMe drives.",
        "Improved efficiency and resiliency of AppVeyor and Octopus Deploy CI/CD pipelines.",
        "Developed a 'Loan Book' event source read model for a PowerBI driven Executive Dashboard, providing an interactive view of outstanding loan balances.",
        "Gained experience in behaviour driven development, and followed SOLID principles while following Cash Converters standard practices to ensure code quality."
      ]
    },
    {
      "company": "IBM, Perth",
      "position": "Intern Software Developer",
      "website": "https://ibm.com.au",
      "startDate": "2016-01-18",
      "endDate": "2017-07-28",
      "highlights": [
        "Added support for new log types and additional dashboards for a mainframe log analysis application, involving the creation of new server-side REST endpoints, additional Angular components for the user interface, and data visualisation with D3.js.",
        "Developed the Java component of a mainframe log consolidation application, which was responsible for accepting events from multiple mainframe sources in their raw format, performed data processing and transformation, then pushed the log events to subscribers, formatted as required by the subscriber.",
        "Even as an intern, I was considered a subject matter expert in the development of the log consolidation application, and was invited to IBM's Raleigh, North Carolina campus to hand over the project to a new team who were to take over its maintenance and development.",
        "Assigned to the team in Raleigh, North Carolina and gained experience in working remotely, attending their stand ups via video chat during US East Coast business hours."
      ]
    }
  ],
  "education": [
    {
      "institution": "ECU, Perth",
      "area": "Computer Science, Software Engineer Major",
      "studyType": "Bachelor",
      "startDate": "2014-06-01",
      "gpa": "3.875",
      "courses": [
        "CSG1132: Communicating in an IT Environment (76 D)",
        "CSI1241: Systems Analysis (80 HD)",
        "CSP1150: Programming Principles (99 HD)",
        "ENS1161: Computer Fundamentals (91 HD)",
        "CSG1105: Applied Communications (77 D)",
        "CSG1207: Systems and Database Design (96 HD)",
        "CSI1101: Computer Security (81 HD)",
        "CSP2348: Data Structures (83 HD)",
        "CSG1102: Operating Systems (89 HD)",
        "CSG2341: Intelligent Systems (85 HD)",
        "CSG2344: Project Methods and Professionalism (73 D)",
        "CSI2441: Applications Development (67 CR)",
        "CSI3345: Work Integrated Learning (IBM Internship) (70 D)",
        "CSP2108: Introduction to Mobile Applications Development (67 CR)",
        "CSP2104: Object-oriented Programming with C++ (98 HD)"
      ]
    },
    {
      "institution": "KvB Institute of Technology, Sydney",
      "area": "Graphic Design, Print and Digital Media",
      "studyType": "Diploma",
      "startDate": "2003-02-17",
      "endDate": "2004-05-07"
    }
  ],
  "skills": [
    {
      "name": "Java server side",
      "level": "Master",
      "keywords": [
        "Maven",
        "Gradle",
        "Spring",
        "JBoss",
        "REST API",
        "TDD",
        "JUnit",
        "Mockito",
        "BDD",
        "JBehave"
      ]
    },
    {
      "name": "Version control",
      "level": "Master",
      "keywords": [
        "git",
        "github",
        "bitbucket",
        "gitlab"
      ]
    },
    {
      "name": "Relational database",
      "level": "Advanced",
      "keywords": [
        "Design and normalization",
        "MS SQL",
        "PL/SQL",
        "MySQL"
      ]
    },
    {
      "name": "CI/CD automation",
      "level": "Advanced",
      "keywords": [
        "TeamCity",
        "Jenkins",
        "AppVeyor",
        "TravisCI",
        "Powershell scripting",
        "Bash scripting"
      ]
    },
    {
      "name": "Project",
      "level": "Advanced",
      "keywords": [
        "Agile",
        "Jira",
        "Confluence",
        "Git",
        "RTC",
        "Scrum"
      ]
    },
    {
      "name": "Client side",
      "level": "Intermediate",
      "keywords": [
        "Javascript",
        "Angular",
        "Typescript",
        "D3.js",
        "HTML",
        "CSS",
        "Bootstrap",
        "PHP"
      ]
    },
    {
      "name": ".NET",
      "level": "Intermediate",
      "keywords": [
        "C#",
        ".NET Core",
        ".NET MVC",
        "MessagePack",
        "xUnit",
        "NSubstitute",
        "BDDfy"
      ]
    },
    {
      "name": "Cloud native",
      "level": "Intermediate",
      "keywords": [
        "Azure",
        "AWS"
      ]
    }
  ],
  "interests": [
    {
      "name": "Basketball",
      "keywords": ["Weekly competition", "NBA fan"]
    },
    {
      "name": "Gaming",
      "keywords": ["Flight sims", "DCS", "Falcon BMS", "Racing sims", "PC", "PS4"]
    },
    {
      "name": "DJ / Music production",
      "keywords": ["Serato", "Ableton Live"]
    }
  ]
}
